[
    {
        "date": "2025/12/14",
        "content": "New blog post with minor technical updates"
    },
    {
        "date": "2025/12/14",
        "content": "Add Aperture Science web-ring widget"
    },
    {
        "date": "2025/12/14",
        "content": "Damn. (Updated Valve-time Widget)"
    },
    {
        "date": "2025/12/08",
        "content": "It's not. (Updated Valve-time Widget)"
    },
    {
        "date": "2025/11/24",
        "content": "Well, is it out yet? (Added Valve-time Widget)"
    },
    {
        "date": "2025/11/24",
        "content": "Add a quick update post and also oops forgot to update my name on the front page lmao"
    },
    {
        "date": "2025/08/06",
        "content": "Okay, I might've forgot to commit adding the GFDKWTFAW webring widget. I might be stupid."
    },
    {
        "date": "2025/08/06",
        "content": "Finally added basic mobile support to the site with a custom menu. I really put that off for too long."
    },
    {
        "date": "2025/07/23",
        "content": "New blog post! Quick update where I've been and upcoming additions to the site."
    },
    {
        "date": "2025/07/13",
        "content": "New blog post, lost something important at an airport."
    },
    {
        "date": "2025/07/12",
        "content": "Populated changelog retroactively according to Git history. I used the recent redesign as a cut-off point."
    },
    {
        "date": "2025/07/12",
        "content": "Added a basic changelog, should make it easier to see what's changed."
    },
    {
        "date": "2025/07/11",
        "content": "Published the current state of my source shrine."
    },
    {
        "date": "2025/07/07",
        "content": "I was accepted into the Aero Webring! Added the widget to the landing page."
    },
    {
        "date": "2025/07/06",
        "content": "Seems like some of the blog posts aren't getting their date property filled in correctly. I've set them to fixed values manually for now."
    },
    {
        "date": "2025/07/06",
        "content": "Added new blog post: We saw Ado live in Milan"
    },
    {
        "date": "2025/07/02",
        "content": "SCMPlayer seems to be scuffed, so I had to remove it for now. Added a blog posts to elaborate."
    },
    {
        "date": "2025/06/24",
        "content": "Update blog post page layout to include some metadata about the post."
    },
    {
        "date": "2025/06/24",
        "content": "I redesigned the site! It should be a lot less bland to look at now. New blog post with the details!"
    }
]
